tap "1password/tap"
tap "apple/apple"
tap "elastic/tap"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "michaeleisel/zld"
tap "oven-sh/bun"
tap "shivammathur/php"
tap "teamookla/speedtest"
tap "tursodatabase/tap"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# Cross-platform make
brew "cmake"
# C library implementing the SSH2 protocol
brew "libssh2"
# Open source suite of directory software
brew "openldap"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Render markdown on the CLI
brew "glow"
# Fulltext search engine and column store
brew "groonga"
# Apache HTTP server
brew "httpd"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Network authentication protocol
brew "krb5"
# Simple terminal UI for git commands
brew "lazygit"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Postgres C API library
brew "libpq"
# Web and API based SMTP testing tool
brew "mailhog"
# Utility for directing compilation
brew "make"
# Drop-in replacement for MySQL
brew "mariadb"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Cross platform, open source .NET development framework
brew "mono"
# Fast, highly customisable system info script
brew "neofetch"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Web interface for MySQL and MariaDB
brew "phpmyadmin"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Manage compile and link flags for libraries
brew "pkg-config"
# Object-relational database system
brew "postgresql@14"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Terminal multiplexer
brew "tmux"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# A faster version of ld, Apple's linker
brew "michaeleisel/zld/zld"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# General-purpose scripting language
brew "shivammathur/php/php@5.6"
# General-purpose scripting language
brew "shivammathur/php/php@7.4", link: true
# General-purpose scripting language
brew "shivammathur/php/php@8.0"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
brew "tursodatabase/tap/turso"
# Command-line interface for 1Password
cask "1password-cli"
# Control USB Cameras from an app
cask "cameracontroller"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Game development engine
cask "godot"
# Free and open-source media player
cask "iina"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customizer
cask "karabiner-elements"
# App to write, plan, collaborate, and get organized
cask "notion"
# Home media server
cask "plex-media-server"
# Peer to peer Bitorrent client
cask "qbittorrent"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "eamodio.gitlens"
vscode "EliverLara.andromeda"
vscode "esbenp.prettier-vscode"
vscode "misogi.ruby-rubocop"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "oven.bun-vscode"
vscode "Prisma.prisma"
vscode "rebornix.ruby"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.LiveServer"
vscode "rust-lang.rust-analyzer"
vscode "vscodevim.vim"
vscode "wingrunr21.vscode-ruby"
vscode "withfig.fig"
vscode "yoavbls.pretty-ts-errors"
